OpenFOAM_Maincode/etc/templates/inflowOutflowRotating/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
    fixed
    {
        type triSurfaceMesh;
        file "fixed.obj";
        regions
        {
            <inletRegion>  { name inlet; }
            <outletRegion> { name outlet; }
        }
    }
    rotating
    {
        type triSurfaceMesh;
        file "rotating.obj";
    }
    rotatingZone
    {
        type triSurfaceMesh;
        file "rotatingZone.obj";
    }
};

castellatedMeshControls
{
    features
    (
        { file "fixed.eMesh";        level 1; }
        { file "rotating.eMesh";     level 1; }
        { file "rotatingZone.eMesh"; level 1; }
    );

    refinementSurfaces
    {
        fixed
        {
            level       (2 2);
            patchInfo   { type wall; }
            inGroups    (fixed);

            regions
            {
                <inletRegion>
                {
                    level (2 2);
                    patchInfo
                    {
                        type patch;
                        inGroups (inlet);
                    }
                }

                <outletRegion>
                {
                    level (2 2);
                    patchInfo
                    {
                        type patch;
                        inGroups (outlet);
                    }
                }
            }
        }
        rotating
        {
            level       (2 2);
            patchInfo   { type wall; }
        }
        rotatingZone
        {
            level       (2 2);
            faceZone    rotatingZone;
            cellZone    rotatingZone;
            mode        inside;
        }

    }

    refinementRegions
    {
        /*
        rotatingZone
        {
            mode    inside;
            level   2;
        }
        */
    }

    insidePoint (1e-5 1e-5 1e-5); // Offset from (0 0 0) to avoid
                                     // coinciding with face or edge
    nCellsBetweenLevels 3;
}

snapControls
{
    explicitFeatureSnap    on;
    implicitFeatureSnap    off;
}

addLayersControls
{
    layers
    {
        "(rotating|fixed)"
        {
            nSurfaceLayers 2;
        }
    }

    relativeSizes       on;   // off, usually with firstLayerThickness
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
//  firstLayerThickness 0.01;

//  maxThicknessToMedialRatio 0.3;
}

writeFlags
(
//    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
